# Module 3 Exercises - Data Manipulation

### Exercise 1:

From the datasets folder, load in the `dupedata.csv` file as a dataframe. Drop the duplicates from the dataframe, keeping the first value (save the resulting dataframe to a new variable).

In [1]:
import pandas as pd

In [2]:
filepath = "../../datasets/dupedata.csv"

In [3]:
dupe_df = pd.read_csv(filepath)
dupe_df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

### Exercise 2:

Using the dataframe in the previous exercise, select all the rows where students received a grade lower than 60 (they need a teacher conference on how to improve for the next test).

In [4]:
dupe_df.loc[dupe_df['grade'] < 60]

,fname,lname,gender,age,exercise,hours,grade,address
340,Abbot,Hall,male,16,4,3,58.9,"84 Rock Creek Lane, Durham, NC 27703"
410,Linda,Baldwin,female,16,5,2,59.0,"970 SW. Second Ave., Cedar Falls, IA 50613"
556,Lacey,Nieves,female,18,1,2,57.9,"38 West Brickyard Avenue, Roslindale, MA 02131"
664,Alika,Poole,female,19,2,16,32.0,"9282 Purple Finch Lane, Lexington, NC 27292"
672,Ciaran,Gay,male,19,4,3,59.3,"157 Bridge Street, Corona, NY 11368"
972,Keegan,Rasmussen,male,19,4,3,43.0,"876 East Pilgrim Street, Chelmsford, MA 01824"
1068,Isaiah,Harrington,male,17,1,4,58.9,"47 Mill Pond St., Haines City, FL 33844"
1207,Selma,Stout,female,19,2,3,59.4,"5 Pierce St., Chester, PA 19013"
1237,Willa,Byers,female,14,2,4,59.2,"9466 Wayne Lane, Torrington, CT 06790"
1494,Jenna,Wagner,female,16,1,3,56.3,"8829 Shore Dr., Hopewell Junction, NY 12533"
1876,Levi,Coleman,male,19,3,3,55.9,"9453 Laurel Street, Jersey City, NJ 07302"
1888,Fitzgerald,Goff,male,18,1,4,59.8,"3 West Shipley Rd., Langhorne, PA 19047"
1916,Gail,Mcneil,female,17,2,3,56.1,"8409A Spruce St., Fishers, IN 46037"
1930,Xanthus,Mcneil,male,16,3,4,59.8,"226 Redwood Lane, Boynton Beach, FL 33435"

### Exercise 3:

Using the dataframe from Exercise 1, select all the rows where a student received a grade of 100 and change their grade to 103 (extra credit!).

In [5]:
dupe_df.loc[dupe_df['grade'] == 100, 'grade'] = 103

In [6]:
dupe_df.loc[dupe_df['grade'] == 103]

,fname,lname,gender,age,exercise,hours,grade,address
17,Libby,Guzman,female,19,1,19,103.0,"666 S. Pennington Rd., Dover, NH 03820"
36,Ivor,Arnold,male,19,4,20,103.0,"7027 Magnolia Dr., Catonsville, MD 21228"
77,Quemby,Justice,female,14,2,17,103.0,"346 Birchpond Court, Decatur, GA 30030"
101,Sage,Cleveland,female,19,2,20,103.0,"9721B Green Dr., Fairhope, AL 36532"
109,Sophia,Gordon,female,19,4,17,103.0,"7672 Smoky Hollow Street, Hillsboro, OR 97124"
165,Ciaran,Johns,male,16,4,15,103.0,"7350 Creek Avenue, Upper Marlboro, MD 20772"
226,Uriah,Cummings,male,18,3,20,103.0,"444 West Homestead Rd., Lebanon, PA 17042"
249,Phyllis,Walters,female,18,4,19,103.0,"33 Smith St., Hephzibah, GA 30815"
252,Rose,Middleton,female,15,2,20,103.0,"979 Andover Street, Cockeysville, MD 21030"
303,Kamal,Walton,male,14,1,17,103.0,"9125 Edgemont Lane, Attleboro, MA 02703"
321,Lysandra,Copeland,female,19,5,19,103.0,"20 Talbot Drive, Fort Lauderdale, FL 33308"
325,Thor,Ramos,male,17,3,18,103.0,"208 Plymouth St., Grove City, OH 43123"
355,Kadeem,Marshall,male,17,5,18,103.0,"56 North Glen Creek St., San Lorenzo, CA 94580"
382,Jacob,Gray,male,15,3,17,103.0,"8323 Alton Court, Clementon, NJ 08021"
434,Kaden,Grant,female,17,5,14,103.0,"73 SW. Leeton Ridge Road, Homestead, FL 33030"
457,Myra,Parrish,female,19,5,15,103.0,"854 3rd Ave., Nanuet, NY 10954"
459,Inez,Stephenson,female,17,5,17,103.0,"51 Academy St., Roselle, IL 60172"
473,Declan,Manning,male,18,4,16,103.0,"7993 E. Harvey Ave., Springfield, PA 19064"
508,Dai,Osborne,female,19,5,20,103.0,"2 Pilgrim Road, Alexandria, VA 22304"
610,Kiara,Singleton,female,16,4,19,103.0,"9800 Atlantic St., Whitestone, NY 11357"
616,Ali,Franks,male,18,5,20,103.0,"78 Essex Road, Stillwater, MN 55082"
621,Gwendolyn,Vazquez,female,19,5,19,103.0,"550 Selby St., Louisville, KY 40207"
644,Drake,Winters,male,17,4,19,103.0,"59 Greenrose St., Conyers, GA 30012"
661,Camille,Barr,female,14,4,14,103.0,"9665 S. Spring Rd., Kaukauna, WI 54130"
690,Sylvester,Payne,male,17,5,20,103.0,"242 Goldfield Ave., Encino, CA 91316"
698,Ruth,Bowman,female,18,3,18,103.0,"8621 Shub Farm Ave., Ocean Springs, MS 39564"
701,Janna,Moran,female,17,5,17,103.0,"4 Belmont St., Fremont, OH 43420"
757,Erich,Stone,male,14,5,17,103.0,"694 W. Heritage Road, Bedford, OH 44146"
767,Lila,Wall,female,17,5,18,103.0,"546 Fulton Lane, Warren, MI 48089"
787,Josephine,Rivers,female,18,2,17,103.0,"8867 Jackson Dr., Newark, NJ 07103"
...,...,...,...,...,...,...,...,...
1421,Harriet,Long,female,17,3,17,103.0,"797 Rockcrest Avenue, Lakewood, NJ 08701"
1426,Shaine,Mcleod,female,16,2,18,103.0,"8400 Brickell Drive, Clayton, NC 27520"
1481,September,Norris,female,15,1,20,103.0,"326 Birch Hill Street, Kent, OH 44240"
1545,Asher,Guerrero,male,14,4,15,103.0,"28 North Charles Road, Lithonia, GA 30038"
1605,Clio,Glover,female,15,4,16,103.0,"405 St Margarets Drive, Tampa, FL 33604"
1629,Cassady,Ruiz,female,16,2,18,103.0,"8233 Thomas Ave., North Miami Beach, FL 33160"
1634,Blossom,Gonzalez,female,17,4,18,103.0,"614 Locust Street, Winter Springs, FL 32708"
1639,Colorado,Cash,male,16,5,18,103.0,"48 King Circle, Griffin, GA 30223"
1649,Igor,Conway,male,17,1,17,103.0,"7859 Carriage Rd., Wilmington, MA 01887"
1650,Denise,Sloan,female,18,4,20,103.0,"36 Bowman Dr., Fort Dodge, IA 50501"
1659,Honorato,Gutierrez,male,16,5,17,103.0,"64 Mill Pond Street, Panama City, FL 32404"
1665,Avram,Huber,male,18,3,20,103.0,"36 S. Pacific Ave., Palm City, FL 34990"
1680,Clayton,Yates,male,16,5,14,103.0,"9528 Miller Drive, Klamath Falls, OR 97603"
1719,Gay,Carlson,female,18,2,20,103.0,"805 Lakeview Avenue, Villa Park, IL 60181"
1724,Carol,Dillard,female,18,5,17,103.0,"929 Pilgrim Road, Venice, FL 34293"
1734,Naomi,Strong,female,15,2,20,103.0,"507 E. Fifth Lane, Natick, MA 01760"
1840,Phillip,Savage,male,19,2,19,103.0,"579 High Ridge Rd., Matawan, NJ 07747"
1841,Maxwell,Blake,male,15,2,17,103.0,"30 Hawthorne Ave., Norfolk, VA 23503"
1842,Louis,Joyner,male,19,2,19,103.0,"7875 Tarkiln Hill Court, Windermere, FL 34786"
1844,Vera,Russell,female,18,4,16,103.0,"122 S. Pulaski St., Wausau, WI 54401"
1850,Yael,Hatfield,female,19,2,18,103.0,"9612 Sherman Avenue, Elk River, MN 55330"
1859,Murphy,Michael,male,14,1,19,103.0,"88 Garden Street, Union, NJ 07083"
1899,Juliet,Good,female,14,5,15,103.0,"69 Lake Forest Lane, Midlothian, VA 23112"
1928,Phelan,Frye,male,16,5,19,103.0,"9614 Winding Way St., Stone Mountain, GA 30083"
1939,Adena,Robinson,female,14,3,19,103.0,"575 Beech Street, Upper Marlboro, MD 20772"
1951,Brianna,Holloway,female,18,4,18,103.0,"8493 Locust Ave., Longwood, FL 32779"
1985,Kai,Woodard,female,17,5,17,103.0,"37 Addison St., Eastpointe, MI 48021"
1987,Leah,Lawrence,female,15,5,15,103.0,"652 Pine Drive, Mountain View, CA 94043"
2002,Geraldine,Peterson,female,16,4,18,103.0,"78 Morris Street, East Northport, NY 11731"
2014,Libby,Guzman,female,19,1,19,103.0,"666 S. Pennington Rd., Dover, NH 03820"

### Exercise 4:

Load in the `travel_times.csv` file as a dataframe. Drop the `Comments` column. Then remove rows from the dataframe that have missing values and assign the resulting dataframe as a new variable.

In [7]:
travel_df = pd.read_csv("../../datasets/travel_times.csv")
travel_df.head()

,Date,StartTime,DayOfWeek,GoingTo,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime,Take407All,Comments
0,1/6/2012,16:37,Friday,Home,51.29,127.4,78.3,84.8,NaN,39.3,36.3,No,NaN
1,1/6/2012,8:20,Friday,GSK,51.63,130.3,81.8,88.9,NaN,37.9,34.9,No,NaN
2,1/4/2012,16:17,Wednesday,Home,51.27,127.4,82.0,85.8,NaN,37.5,35.9,No,NaN
3,1/4/2012,7:53,Wednesday,GSK,49.17,132.3,74.2,82.9,NaN,39.8,35.6,No,NaN
4,1/3/2012,18:57,Tuesday,Home,51.15,136.2,83.4,88.1,NaN,36.8,34.8,No,NaN

In [10]:
travel_df.drop('Comments', axis=1, inplace=True)

In [11]:
travel_df.isnull().sum()

Date               0
StartTime          0
DayOfWeek          0
GoingTo            0
Distance           0
MaxSpeed           0
AvgSpeed           0
AvgMovingSpeed     0
FuelEconomy       19
TotalTime          0
MovingTime         0
Take407All         0
dtype: int64

In [12]:
travel_df.dropna(inplace=True)

In [13]:
travel_df.isnull().sum()

Date              0
StartTime         0
DayOfWeek         0
GoingTo           0
Distance          0
MaxSpeed          0
AvgSpeed          0
AvgMovingSpeed    0
FuelEconomy       0
TotalTime         0
MovingTime        0
Take407All        0
dtype: int64

### Exercise 5:

Using the dataframe from the exercise above (w/ no missing values), create bins that will categorize the AvgSpeed column as "slow" or "fast", and make a new column called "Speed" to hold those new values. Values less than 75 are "slow" and everything above is "fast".

In [15]:
bins = [0, 75, 200]

categories = ["slow", "fast"]

In [16]:
travel_df['Speed'] = pd.cut(travel_df['AvgSpeed'], bins, labels=categories)

In [17]:
travel_df.head()

,Date,StartTime,DayOfWeek,GoingTo,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime,Take407All,Speed
8,12/23/2011,8:01,Friday,GSK,52.91,130.3,80.9,88.3,8.89,39.3,36.0,No,fast
9,12/22/2011,17:19,Thursday,Home,51.17,122.3,70.6,78.1,8.89,43.5,39.3,No,slow
10,12/22/2011,8:16,Thursday,GSK,49.15,129.4,74.0,81.4,8.89,39.8,36.2,No,slow
11,12/21/2011,7:45,Wednesday,GSK,51.77,124.8,71.7,78.9,8.89,43.3,39.4,No,slow
12,12/20/2011,16:05,Tuesday,Home,51.45,130.1,75.2,82.7,8.89,41.1,37.3,No,fast

### Exercise 6:

Using the dataframe in the previous exercise, make a new column called `Police` where all the values are "no" (they were never stopped by police for speeding while traveling).

In [18]:
travel_df['Police'] = "no"

In [19]:
travel_df.head()

,Date,StartTime,DayOfWeek,GoingTo,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime,Take407All,Speed,Police
8,12/23/2011,8:01,Friday,GSK,52.91,130.3,80.9,88.3,8.89,39.3,36.0,No,fast,no
9,12/22/2011,17:19,Thursday,Home,51.17,122.3,70.6,78.1,8.89,43.5,39.3,No,slow,no
10,12/22/2011,8:16,Thursday,GSK,49.15,129.4,74.0,81.4,8.89,39.8,36.2,No,slow,no
11,12/21/2011,7:45,Wednesday,GSK,51.77,124.8,71.7,78.9,8.89,43.3,39.4,No,slow,no
12,12/20/2011,16:05,Tuesday,Home,51.45,130.1,75.2,82.7,8.89,41.1,37.3,No,fast,no

### Exercise 7:

Using the dataframe from the previous exercise, pick a method (Standard Deviation or Interquartile Range) and remove the outliers from the "FuelEconomy" column.

In [20]:
travel_df.dtypes

Date                object
StartTime           object
DayOfWeek           object
GoingTo             object
Distance           float64
MaxSpeed           float64
AvgSpeed           float64
AvgMovingSpeed     float64
FuelEconomy        float64
TotalTime          float64
MovingTime         float64
Take407All          object
Speed             category
Police              object
dtype: object